---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.IndexPoint.Index
source: html/9d9cae61-ab67-6410-7928-5e36b29bd11d.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexPoint.Index Property

The index of the point's vertex.

## Syntax (C#)
```csharp
public int Index { get; set; }
```